app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("created_at", "title", "method", "updated_at") VALUES('2011-01-31 11:10:09', NULL, NULL, '2011-01-31 11:10:09')
---
  def create
    @recipe = Recipe.new(params[:recipe])
    if @recipe.save

SELECT * FROM "recipes" WHERE ("recipes"."id" = 6)
UPDATE "recipes" SET "updated_at" = '2011-02-07 11:05:35', "method" = 'Toast bread, butter toast, fry sausages then put onto bread, add tomato sauce, enjoy! iuionoi' WHERE "id" = 6
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update_attributes(params[:recipe])